#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/calyptia/fluent-bit-infra/runs/run-22BaujPXiezUCnKf

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
data.cloudflare_zones.fluentbit-io-zone: Reading...
tls_private_key.gh-runner-provision-key: Refreshing state... [id=7d2b71a947985b05873fa16c3f290a2aeca67a6c]
metal_device.packages-fluent-bit: Refreshing state... [id=3ae2407d-8437-4bbe-b3d0-57470c24bdab]
metal_device.packages-next-fluent-bit: Refreshing state... [id=c089c66e-a06a-4019-9f97-e09f4032b5bd]
metal_ssh_key.gh-runner-provision-ssh-pub-key: Refreshing state... [id=4d238aaf-11fe-4afb-9e9b-34ffb4bec56d]
data.github_repository.fluent-bit-mirror: Reading...
data.github_repository.fluent-bit-ci: Reading...
github_team.fluent-bit-sandbox-maintainers: Refreshing state... [id=5969310]
github_repository.fluent-bit-sandbox: Refreshing state... [id=fluent-bit-sandbox]
github_repository.fluent-bit-unstable-releases: Refreshing state... [id=fluent-bit-unstable-releases]
data.github_repository.fluentbit: Reading...
data.github_user.release-approvers-users["agup006"]: Reading...
data.cloudflare_zones.fluentbit-io-zone: Read complete after 1s [id=a897c06ca39ad8df8fb9be02b366dfca]
data.github_user.release-approvers-users["celalettin1286"]: Reading...
data.github_repository.fluent-bit-ci: Read complete after 0s [id=fluent-bit-ci]
data.github_user.release-approvers-users["edsiper"]: Reading...
data.github_repository.fluent-bit-mirror: Read complete after 0s [id=fluent-bit-mirror]
data.github_user.release-approvers-users["niedbalski"]: Reading...
data.github_user.release-approvers-users["patrick-stephens"]: Reading...
google_compute_address.static: Refreshing state... [id=projects/fluent-bit-ci/regions/us-east1/addresses/ipv4-address]
google_compute_disk.test-data: Refreshing state... [id=projects/fluent-bit-ci/zones/us-east1-c/disks/test-data]
google_compute_disk.test-data-01: Refreshing state... [id=projects/fluent-bit-ci/zones/us-east1-c/disks/test-data-01]
google_compute_address.static-01: Refreshing state... [id=projects/fluent-bit-ci/regions/us-east1/addresses/ipv4-address-01]
google_compute_network.default-services: Refreshing state... [id=projects/fluent-bit-ci/global/networks/default-public-svc-network]
metal_device.gh-runners["x64"]: Refreshing state... [id=47b71ede-1401-4f41-857d-b83215e52621]
metal_device.gh-runners["arm64"]: Refreshing state... [id=ec1f3769-1331-4be1-8207-81688e4f2696]
cloudflare_record.test: Refreshing state... [id=f861ed655d4ed62b4c19c82de120179c]
cloudflare_record.fluentd-config-validator: Refreshing state... [id=a683b867e465952b0a41ddbeb8a464c8]
cloudflare_page_rule.releases-fluentbitio: Refreshing state... [id=1bbac17c5d0bcd0da6e779361ec5ca41]
cloudflare_record.cloud-monitoring-api-dev: Refreshing state... [id=b733bf55decf54e7cd37bdc6bbcef130]
cloudflare_record.packages-s3-mirror: Refreshing state... [id=49611c7140cc1917dc9e636f699d7b37]
cloudflare_record.docs: Refreshing state... [id=e2ca6fd8bc5ac015448c741d0b850e61]
data.github_repository.fluentbit: Read complete after 1s [id=fluent-bit]
cloudflare_record.short-registry: Refreshing state... [id=c4a4f01a2be5fea4c8a7b20bc28a85fe]
data.github_user.release-approvers-users["agup006"]: Read complete after 1s [id=3642874]
cloudflare_record.config-validator-dev: Refreshing state... [id=8a57626a631ddc89017f20c11a3b9ce4]
cloudflare_record.releases-s3-mirror: Refreshing state... [id=7af33432077b344ff1312d265d79c314]
data.github_user.release-approvers-users["celalettin1286"]: Read complete after 1s [id=29018400]
cloudflare_page_rule.releases-next-fluentbitio: Refreshing state... [id=8d3b97776160ebb0acb97a82cca5c50d]
cloudflare_record.fluentd-config-validator-dev: Refreshing state... [id=954fec0843bf6cc062a6aabd9c9e1811]
data.github_user.release-approvers-users["edsiper"]: Read complete after 1s [id=369718]
cloudflare_record.www: Refreshing state... [id=962890f07d1facb9c4f95f71c0dadbac]
data.github_user.release-approvers-users["niedbalski"]: Read complete after 1s [id=821670]
cloudflare_record.registry: Refreshing state... [id=c8896e619f5c0ace02059e0457c23ffe]
data.github_user.release-approvers-users["patrick-stephens"]: Read complete after 1s [id=6388272]
cloudflare_record.root-www: Refreshing state... [id=d09f8846b7b52cbd89011619edf8dc7d]
cloudflare_page_rule.docs-fluentbitio: Refreshing state... [id=9b028036a9507ab028b1b49809572732]
cloudflare_page_rule.downloads-fluentbitio: Refreshing state... [id=34ebbbf674a600e76a0ea6a2b91d975d]
cloudflare_record.config-validator: Refreshing state... [id=4e3cd831fb498c19cad0e1c4f30d800e]
cloudflare_record.backup: Refreshing state... [id=67c3eccf0a0834b01884701016dffd8a]
github_branch.mirror-main-branch: Refreshing state... [id=fluent-bit-mirror:mirror-main]
github_team_membership.fluent-bit-sandbox-maintainers["agup006"]: Refreshing state... [id=5969310:agup006]
github_team_membership.fluent-bit-sandbox-maintainers["edsiper"]: Refreshing state... [id=5969310:edsiper]
github_team_membership.fluent-bit-sandbox-maintainers["niedbalski"]: Refreshing state... [id=5969310:niedbalski]
github_team_membership.fluent-bit-sandbox-maintainers["patrick-stephens"]: Refreshing state... [id=5969310:patrick-stephens]
cloudflare_record.packages: Refreshing state... [id=f7ce9c8999d7f4fa812ff1176543e81e]
cloudflare_record.releases: Refreshing state... [id=30ae0569a925a09b0cb42449d8cae86a]
cloudflare_record.apt: Refreshing state... [id=5ca012769dedb027234bdb0e96c2fead]
cloudflare_record.releases-next: Refreshing state... [id=1fdf9c10a47e6b85a347b0d29598782b]
cloudflare_record.apt-next: Refreshing state... [id=8d6538ff8dbbece65608279cdea5ec3e]
cloudflare_record.packages-next: Refreshing state... [id=a234592c8f05ca1489806242bf7fba36]
github_branch_protection_v3.fluent-bit-sandbox: Refreshing state... [id=fluent-bit-sandbox:main]
github_team_repository.fluent-bit-sandbox-maintainers: Refreshing state... [id=5969310:fluent-bit-sandbox]
github_branch_protection_v3.fluent-bit-unstable-releases: Refreshing state... [id=fluent-bit-unstable-releases:main]
google_compute_subnetwork.default-services-subnet: Refreshing state... [id=projects/fluent-bit-ci/regions/us-east1/subnetworks/default-public-svc-subnet]
google_compute_firewall.ssh_default: Refreshing state... [id=projects/fluent-bit-ci/global/firewalls/default-public-svc-ssh]
cloudflare_record.gh-runners["arm64"]: Refreshing state... [id=6f2f6feb5e03e0729f2d0b071ccfb07a]
cloudflare_record.gh-runners["x64"]: Refreshing state... [id=50337bb3f462f47a3135bdff3e2e9d35]
null_resource.gh-runners-provision["x64"]: Refreshing state... [id=4138320923887792658]
null_resource.gh-runners-provision["arm64"]: Refreshing state... [id=5869905610083058987]
github_repository_environment.unstable-environment: Refreshing state... [id=fluent-bit:unstable]
github_actions_secret.appveyor_token: Refreshing state... [id=fluent-bit:APPVEYOR_TOKEN]
github_repository_environment.staging-environment: Refreshing state... [id=fluent-bit:staging]
github_actions_secret.appveyor_account: Refreshing state... [id=fluent-bit:APPVEYOR_ACCOUNT]
github_branch_protection_v3.default-branch-protection["1.8"]: Refreshing state... [id=fluent-bit:1.8]
github_branch_protection_v3.default-branch-protection["1.9"]: Refreshing state... [id=fluent-bit:1.9]
github_branch_protection_v3.default-branch-protection["2.0"]: Refreshing state... [id=fluent-bit:2.0]
github_branch_protection_v3.default-branch-protection["master"]: Refreshing state... [id=fluent-bit:master]
github_repository_environment.release-environment: Refreshing state... [id=fluent-bit:release]
github_branch_default.mirror-default-branch: Refreshing state... [id=fluent-bit-mirror]
google_compute_instance.long-running-test: Refreshing state... [id=projects/fluent-bit-ci/zones/us-east1-c/instances/long-running-test]
google_compute_instance.long-running-test-01: Refreshing state... [id=projects/fluent-bit-ci/zones/us-east1-c/instances/long-running-test-01]
github_actions_secret.fluent-bit-ci-opensearch-aws-secret-key["fluent-bit"]: Refreshing state... [id=fluent-bit:OPENSEARCH_AWS_SECRET_KEY]
github_actions_secret.fluent-bit-ci-opensearch-aws-secret-key["fluent-bit-ci"]: Refreshing state... [id=fluent-bit-ci:OPENSEARCH_AWS_SECRET_KEY]
github_actions_secret.fluent-bit-ci-opensearch-aws-secret-key["fluent-bit-mirror"]: Refreshing state... [id=fluent-bit-mirror:OPENSEARCH_AWS_SECRET_KEY]
github_actions_secret.fluent-bit-ci-opensearch-password["fluent-bit-ci"]: Refreshing state... [id=fluent-bit-ci:OPENSEARCH_ADMIN_PASSWORD]
github_actions_secret.fluent-bit-ci-opensearch-password["fluent-bit-mirror"]: Refreshing state... [id=fluent-bit-mirror:OPENSEARCH_ADMIN_PASSWORD]
github_actions_secret.fluent-bit-ci-opensearch-password["fluent-bit"]: Refreshing state... [id=fluent-bit:OPENSEARCH_ADMIN_PASSWORD]
github_actions_secret.fluent-bit-ci-opensearch-aws-access-id["fluent-bit-ci"]: Refreshing state... [id=fluent-bit-ci:OPENSEARCH_AWS_ACCESS_ID]
github_actions_secret.fluent-bit-ci-opensearch-aws-access-id["fluent-bit-mirror"]: Refreshing state... [id=fluent-bit-mirror:OPENSEARCH_AWS_ACCESS_ID]
github_actions_secret.fluent-bit-ci-opensearch-aws-access-id["fluent-bit"]: Refreshing state... [id=fluent-bit:OPENSEARCH_AWS_ACCESS_ID]
github_actions_secret.ffluent-bit-ci-azure-client-secret["fluent-bit-mirror"]: Refreshing state... [id=fluent-bit-mirror:AZURE_CLIENT_SECRET]
github_actions_secret.ffluent-bit-ci-azure-client-secret["fluent-bit"]: Refreshing state... [id=fluent-bit:AZURE_CLIENT_SECRET]
github_actions_secret.ffluent-bit-ci-azure-client-secret["fluent-bit-ci"]: Refreshing state... [id=fluent-bit-ci:AZURE_CLIENT_SECRET]
github_actions_secret.fluent-bit-ci-azure-client-id["fluent-bit"]: Refreshing state... [id=fluent-bit:AZURE_CLIENT_ID]
github_actions_secret.fluent-bit-ci-azure-client-id["fluent-bit-ci"]: Refreshing state... [id=fluent-bit-ci:AZURE_CLIENT_ID]
github_actions_secret.fluent-bit-ci-azure-client-id["fluent-bit-mirror"]: Refreshing state... [id=fluent-bit-mirror:AZURE_CLIENT_ID]
github_actions_secret.fluent-bit-ci-azure-subscription-id["fluent-bit-ci"]: Refreshing state... [id=fluent-bit-ci:AZURE_SUBSCRIPTION_ID]
github_actions_secret.fluent-bit-ci-azure-subscription-id["fluent-bit-mirror"]: Refreshing state... [id=fluent-bit-mirror:AZURE_SUBSCRIPTION_ID]
github_actions_secret.fluent-bit-ci-azure-subscription-id["fluent-bit"]: Refreshing state... [id=fluent-bit:AZURE_SUBSCRIPTION_ID]
github_actions_secret.fluent-bit-ci-azure-tenant-id["fluent-bit-mirror"]: Refreshing state... [id=fluent-bit-mirror:AZURE_TENANT_ID]
github_actions_secret.fluent-bit-ci-azure-tenant-id["fluent-bit"]: Refreshing state... [id=fluent-bit:AZURE_TENANT_ID]
github_actions_secret.fluent-bit-ci-azure-tenant-id["fluent-bit-ci"]: Refreshing state... [id=fluent-bit-ci:AZURE_TENANT_ID]
github_actions_environment_secret.unstable-release-repos["staging"]: Refreshing state... [id=fluent-bit:staging:RELEASE_REPO]
github_actions_environment_secret.unstable-release-repos["unstable"]: Refreshing state... [id=fluent-bit:unstable:RELEASE_REPO]
github_actions_environment_secret.staging-gpg-private-key-passphrase-secret: Refreshing state... [id=fluent-bit:staging:GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_environment_secret.unstable-release-tokens["staging"]: Refreshing state... [id=fluent-bit:staging:RELEASE_TOKEN]
github_actions_environment_secret.unstable-release-tokens["unstable"]: Refreshing state... [id=fluent-bit:unstable:RELEASE_TOKEN]
github_actions_environment_secret.staging-bucket-secret: Refreshing state... [id=fluent-bit:staging:AWS_S3_BUCKET_STAGING]
github_actions_environment_secret.staging-aws-secret-access-key-secret: Refreshing state... [id=fluent-bit:staging:AWS_SECRET_ACCESS_KEY]
github_actions_environment_secret.staging-gpg-private-key-secret: Refreshing state... [id=fluent-bit:staging:GPG_PRIVATE_KEY]
github_actions_environment_secret.staging-aws-access-key-id-secret: Refreshing state... [id=fluent-bit:staging:AWS_ACCESS_KEY_ID]
github_actions_environment_secret.release-server-sshkey: Refreshing state... [id=fluent-bit:release:FLUENTBITIO_SSHKEY]
github_actions_environment_secret.release-cosign-private-key: Refreshing state... [id=fluent-bit:release:COSIGN_PRIVATE_KEY]
github_actions_environment_secret.release-staging-bucket-secret: Refreshing state... [id=fluent-bit:release:AWS_S3_BUCKET_STAGING]
github_actions_environment_secret.release-bucket-secret: Refreshing state... [id=fluent-bit:release:AWS_S3_BUCKET_RELEASE]
github_actions_environment_secret.release-server-hostname: Refreshing state... [id=fluent-bit:release:FLUENTBITIO_HOST]
github_actions_environment_secret.release-dockerhub-org: Refreshing state... [id=fluent-bit:release:DOCKERHUB_ORGANIZATION]
github_actions_environment_secret.release-dockerhub-token: Refreshing state... [id=fluent-bit:release:DOCKERHUB_TOKEN]
github_actions_environment_secret.release-gpg-private-key-passphrase-secret: Refreshing state... [id=fluent-bit:release:GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_environment_secret.release-aws-secret-access-key-secret: Refreshing state... [id=fluent-bit:release:AWS_SECRET_ACCESS_KEY]
github_actions_environment_secret.release-sources-bucket-secret: Refreshing state... [id=fluent-bit:release:AWS_S3_BUCKET_RELEASE_SOURCES]
github_actions_environment_secret.release-gpg-private-key-secret: Refreshing state... [id=fluent-bit:release:GPG_PRIVATE_KEY]
github_actions_environment_secret.release-aws-access-key-id-secret: Refreshing state... [id=fluent-bit:release:AWS_ACCESS_KEY_ID]
github_actions_environment_secret.release-dockerhub-username: Refreshing state... [id=fluent-bit:release:DOCKERHUB_USERNAME]
github_actions_environment_secret.release-server-username: Refreshing state... [id=fluent-bit:release:FLUENTBITIO_USERNAME]
github_actions_secret.mirror-release-secrets["DOCKERHUB_TOKEN"]: Refreshing state... [id=fluent-bit-mirror:DOCKERHUB_TOKEN]
github_actions_secret.mirror-release-secrets["GPG_PRIVATE_KEY_PASSPHRASE"]: Refreshing state... [id=fluent-bit-mirror:GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.mirror-release-secrets["AWS_S3_BUCKET_RELEASE"]: Refreshing state... [id=fluent-bit-mirror:AWS_S3_BUCKET_RELEASE]
github_actions_secret.mirror-release-secrets["GPG_PRIVATE_KEY"]: Refreshing state... [id=fluent-bit-mirror:GPG_PRIVATE_KEY]
github_actions_secret.mirror-release-secrets["COSIGN_PRIVATE_KEY"]: Refreshing state... [id=fluent-bit-mirror:COSIGN_PRIVATE_KEY]
github_actions_secret.mirror-release-secrets["FLUENTBITIO_USERNAME"]: Refreshing state... [id=fluent-bit-mirror:FLUENTBITIO_USERNAME]
github_actions_secret.mirror-release-secrets["FLUENTBITIO_HOST"]: Refreshing state... [id=fluent-bit-mirror:FLUENTBITIO_HOST]
github_actions_secret.mirror-release-secrets["DOCKERHUB_USERNAME"]: Refreshing state... [id=fluent-bit-mirror:DOCKERHUB_USERNAME]
github_actions_secret.mirror-release-secrets["AWS_S3_BUCKET_STAGING"]: Refreshing state... [id=fluent-bit-mirror:AWS_S3_BUCKET_STAGING]
github_actions_secret.mirror-release-secrets["FLUENTBITIO_SSHKEY"]: Refreshing state... [id=fluent-bit-mirror:FLUENTBITIO_SSHKEY]
github_actions_secret.mirror-release-secrets["AWS_SECRET_ACCESS_KEY"]: Refreshing state... [id=fluent-bit-mirror:AWS_SECRET_ACCESS_KEY]
github_actions_secret.mirror-release-secrets["DOCKERHUB_ORGANIZATION"]: Refreshing state... [id=fluent-bit-mirror:DOCKERHUB_ORGANIZATION]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_record.apt will be updated in-place
  ~ resource "cloudflare_record" "apt" {
        id              = "5ca012769dedb027234bdb0e96c2fead"
        name            = "apt"
        tags            = []
      ~ value           = "147.28.182.97" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # cloudflare_record.packages will be updated in-place
  ~ resource "cloudflare_record" "packages" {
        id              = "f7ce9c8999d7f4fa812ff1176543e81e"
        name            = "packages"
        tags            = []
      ~ value           = "147.28.182.97" -> (known after apply)
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # cloudflare_record.releases will be updated in-place
  ~ resource "cloudflare_record" "releases" {
        id              = "30ae0569a925a09b0cb42449d8cae86a"
        name            = "releases"
        tags            = []
      ~ value           = "147.28.182.97" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # github_repository_environment.release-environment will be updated in-place
  ~ resource "github_repository_environment" "release-environment" {
        id          = "fluent-bit:release"
        # (2 unchanged attributes hidden)

      ~ reviewers {
          ~ users = [
              + 29018400,
                # (4 unchanged elements hidden)
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # metal_device.packages-fluent-bit must be replaced
-/+ resource "metal_device" "packages-fluent-bit" {
      ~ access_private_ipv4              = "10.70.90.135" -> (known after apply)
      ~ access_public_ipv4               = "147.28.182.97" -> (known after apply)
      ~ access_public_ipv6               = "2604:1380:4642:2300::7" -> (known after apply)
      ~ created                          = "2023-01-12T12:08:32Z" -> (known after apply)
      ~ deployed_facility                = "da11" -> (known after apply)
      + deployed_hardware_reservation_id = (known after apply)
      - facilities                       = [
          - "da11",
        ] -> null
      ~ id                               = "3ae2407d-8437-4bbe-b3d0-57470c24bdab" -> (known after apply)
      - ipxe_script_url                  = "" -> null
      ~ locked                           = true -> (known after apply)
      ~ network                          = [
          - {
              - address = "147.28.182.97"
              - cidr    = 31
              - family  = 4
              - gateway = "147.28.182.96"
              - public  = true
            },
          - {
              - address = "2604:1380:4642:2300::7"
              - cidr    = 127
              - family  = 6
              - gateway = "2604:1380:4642:2300::6"
              - public  = true
            },
          - {
              - address = "10.70.90.135"
              - cidr    = 31
              - family  = 4
              - gateway = "10.70.90.134"
              - public  = false
            },
        ] -> (known after apply)
      ~ network_type                     = "layer3" -> (known after apply)
      ~ ports                            = [
          - {
              - bonded = true
              - id     = "fea24e48-1b0f-43d6-ab90-392e6a9e44cb"
              - mac    = "f8:f2:1e:87:c0:80"
              - name   = "eth0"
              - type   = "NetworkPort"
            },
          - {
              - bonded = true
              - id     = "49a37834-43c7-4499-8c25-aa9f9d4e5867"
              - mac    = "f8:f2:1e:87:c0:81"
              - name   = "eth1"
              - type   = "NetworkPort"
            },
          - {
              - bonded = true
              - id     = "81d5a4d6-97e7-4fe7-803c-2cc6f18fbe76"
              - mac    = ""
              - name   = "bond0"
              - type   = "NetworkBondPort"
            },
        ] -> (known after apply)
      ~ root_password                    = (sensitive value)
      ~ ssh_key_ids                      = [
          - "7d88f580-43da-4748-b3d4-d33120c3cefb",
          - "12982b06-bcc5-4272-8b86-bda4e241ace5",
          - "1e21d0c6-fdda-45f4-979b-1ea438c6a248",
          - "63ff96f1-1e6d-4a4a-9f50-ab026c9059c3",
          - "5f2f25b4-81de-40ce-ae1e-19629e9f2e24",
          - "634b9b71-327b-48a6-9b47-2c60f23c8410",
          - "4d238aaf-11fe-4afb-9e9b-34ffb4bec56d",
          - "88d645f5-c6c2-47bc-b23e-991e92e8753c",
          - "f445dcb8-6b19-44af-865f-bd5be5fcf37c",
          - "dbfd215e-cf88-4bff-96ce-62375d45ea79",
          - "93e15f6b-d45a-4704-9732-4748ad13eae6",
          - "bfa3dbf1-1f48-41b1-9e29-e3ceda891232",
          - "60f04f19-f108-4a26-aed2-624c18cf5b7d",
          - "5c5df043-14a8-4bb0-98dc-0b3a0b4b8224",
          - "7fb2fe6f-7146-4f18-ac10-6a6ed62be1d5",
          - "8d892ec0-a6d0-4f2b-825e-f695eafda7fd",
          - "2b2e94f7-b372-4e00-a9e2-a853ea689ff2",
          - "027c5898-fd71-4e2e-8190-2a7a8f575e63",
          - "2615a089-31fa-4667-979c-7f453f1234d9",
          - "621e7464-6e33-4acb-bb2d-b095b1260fd3",
        ] -> (known after apply)
      ~ state                            = "active" -> (known after apply)
      - tags                             = [] -> null
      - termination_time                 = "" -> null
      ~ updated                          = "2023-07-07T02:44:49Z" -> (known after apply)
      ~ user_data                        = (sensitive value) # forces replacement
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.
╷
│ Warning: "required_status_checks.0.contexts": [DEPRECATED] GitHub is deprecating the use of `contexts`. Use a `checks` array instead.
│ 
│   with github_branch_protection_v3.default-branch-protection,
│   on github.tf line 40, in resource "github_branch_protection_v3" "default-branch-protection":
│   40: resource "github_branch_protection_v3" "default-branch-protection" {
│ 
│ (and 4 more similar warnings elsewhere)
╵
╷
│ Warning: Deprecated Resource
│ 
│   with metal_ssh_key.gh-runner-provision-ssh-pub-key,
│   on machines.tf line 181, in resource "metal_ssh_key" "gh-runner-provision-ssh-pub-key":
│  181: resource "metal_ssh_key" "gh-runner-provision-ssh-pub-key" {
│ 
│ Equinix Metal Provider is now Deprecated (End-of-Life scheduled for July 1,
│ 2023) meaning that this software is only supported or maintained by Equinix
│ Metal and its community in a case-by-case basis. The Equinix provider
│ (https://registry.terraform.io/providers/equinix/equinix/latest/docs) has
│ full support for existing Terraform managed Metal resources once Terraform
│ configuration and state are adapted. The Equinix provider manages resources
│ including Network Edge and Fabric in addition to Metal. Please review the
│ Metal to Equinix provider migration guide:
│ https://registry.terraform.io/providers/equinix/equinix/latest/docs/guides/migration_guide_equinix_metal
│ 
│ (and 8 more similar warnings elsewhere)
╵

```
</details>
*Pushed by: @celalettin1286, Action: `pull_request`*